In [1]:
import numpy as np
import pandas as pd

In [2]:
# 성적 데이터프레임 생성
data = np.random.randint(1, 100, size=(4, 6))
df = pd.DataFrame(data)
df

    0   1   2   3   4   5
0  69  91  94  29  63  58
1  66  16  46  18  81  12
2  65  58   8  84  30  35
3  38  17  95  76  13  57

In [3]:
# 학년, 반 데이터프레임 생성
df2 = pd.DataFrame({'학년': ['1학년', '1학년', '2학년', '2학년'], '반': ['1반', '2반', '1반', '2반']})
df2

    학년   반
0  1학년  1반
1  1학년  2반
2  2학년  1반
3  2학년  2반

In [4]:
# 두 데이터프레임 결합
df = pd.concat([df, df2], axis=1)
df

    0   1   2   3   4   5   학년   반
0  69  91  94  29  63  58  1학년  1반
1  66  16  46  18  81  12  1학년  2반
2  65  58   8  84  30  35  2학년  1반
3  38  17  95  76  13  57  2학년  2반

### 멀티 인데스

In [5]:
# set_index 사용해 멀티 인덱스 생성
df = df.set_index(['학년', '반'])
df

         0   1   2   3   4   5
학년  반
1학년 1반  69  91  94  29  63  58
    2반  66  16  46  18  81  12
2학년 1반  65  58   8  84  30  35
    2반  38  17  95  76  13  57

In [6]:
# MultiIndex.from_product 사용해 멀티 인덱스 생성
df.index = pd.MultiIndex.from_product([['1학년', '2학년'], ['1반', '2반']], names=['학년', '반'])
df

         0   1   2   3   4   5
학년  반
1학년 1반  69  91  94  29  63  58
    2반  66  16  46  18  81  12
2학년 1반  65  58   8  84  30  35
    2반  38  17  95  76  13  57

In [7]:
df.index

MultiIndex([('1학년', '1반'),
            ('1학년', '2반'),
            ('2학년', '1반'),
            ('2학년', '2반')],
           names=['학년', '반'])

In [8]:
# 멀티 인덱스 요소 확인(중복 제거)
df.index.levels

FrozenList([['1학년', '2학년'], ['1반', '2반']])

In [9]:
# 멀티 인덱스 특정 컬럼 확인
print(df.index.get_level_values(0))
df.index.get_level_values(1)

Index(['1학년', '1학년', '2학년', '2학년'], dtype='object', name='학년')

Index(['1반', '2반', '1반', '2반'], dtype='object', name='반')

In [10]:
# 인덱스를 컬럼으로 변환
df.reset_index()

    학년   반   0   1   2   3   4   5
0  1학년  1반  69  91  94  29  63  58
1  1학년  2반  66  16  46  18  81  12
2  2학년  1반  65  58   8  84  30  35
3  2학년  2반  38  17  95  76  13  57

### 멀티 컬럼

In [15]:
df.columns = pd.MultiIndex.from_product([['홍길동', '이순신', '임꺽정'], ['국어', '영어']])
df

       홍길동     이순신     임꺽정
        국어  영어  국어  영어  국어  영어
학년  반
1학년 1반  69  91  94  29  63  58
    2반  66  16  46  18  81  12
2학년 1반  65  58   8  84  30  35
    2반  38  17  95  76  13  57

In [13]:
df.columns

MultiIndex([('홍길동', '국어'),
            ('홍길동', '영어'),
            ('이순신', '국어'),
            ('이순신', '영어'),
            ('임꺽정', '국어'),
            ('임꺽정', '영어')],
           )

In [16]:
# 멀티 컬럼 요소 확인(중복 제거)
df.columns.levels

FrozenList([['이순신', '임꺽정', '홍길동'], ['국어', '영어']])

In [19]:
# 멀티 컬럼 특정 행 요소 확인
print(df.columns.get_level_values(0))
df.columns.get_level_values(1)

Index(['홍길동', '홍길동', '이순신', '이순신', '임꺽정', '임꺽정'], dtype='object')

Index(['국어', '영어', '국어', '영어', '국어', '영어'], dtype='object')